In [251]:
# 1. 타이타닉 데이터에 대해...

ttn=pd.read_csv('data/train.csv')

# 1-1. Pclass를 원핫인코딩

bins=np.linspace(ttn.Pclass.max(),ttn.Pclass.min(),3)
ttn['Pclass_bins']=np.digitize(ttn.Pclass,bins)
pd.get_dummies(ttn.Pclass_bins)

     0  1  2
0    1  0  0
1    0  0  1
2    1  0  0
3    0  0  1
4    1  0  0
..  .. .. ..
886  0  1  0
887  0  0  1
888  1  0  0
889  0  0  1
890  1  0  0

[891 rows x 3 columns]

In [326]:
# 1-2. Age를 이산화(5개 구간으로 나눔)

bins=np.linspace(ttn.Age.max(),ttn.Age.min(),5,dtype=int)
Age_bins=np.digitize(ttn.Age.dropna(),bins) # NaN 값이 많아서 제외하도록 함
res=pd.DataFrame(ttn.Age.dropna().groupby(Age_bins).size(),columns=['Age'])
res.index=bins

In [327]:
res

    Age
80    1
60   25
40  137
20  387
0   164

In [330]:
# 1-3. Fare를 이산화(3개 구간으로 나눔)

bins=np.linspace(ttn.Fare.max(),ttn.Fare.min(),3,dtype=int)
Fare_bins=np.digitize(ttn.Fare,bins)
res=pd.DataFrame(ttn.groupby(Fare_bins).size(),columns=['Fare'])
res.index=bins

In [331]:
res

     Fare
512     3
256     6
0     882

In [341]:
# 1-4 embarked를 원핫인코딩
 
pd.get_dummies(ttn.Embarked)

     C  Q  S
0    0  0  1
1    1  0  0
2    0  0  1
3    0  0  1
4    0  0  1
..  .. .. ..
886  0  0  1
887  0  0  1
888  0  0  1
889  1  0  0
890  0  1  0

[891 rows x 3 columns]

In [348]:
# 2. 리스트를 거꾸로 출력하는 반복문을 만들어 보세요. (2가지 방법)

lst=list(range(10))

# 첫 번째 방법
for i in range(len(lst)):
    print(lst[-i-1])
    
# 두 번째 방법
lst.reverse()

9
8
7
6
5
4
3
2
1
0

In [350]:
# 3. 리스트에서 중복 값을 제거해 보세요.

ns = [1, 3, 5, 1, 3, 5, 1, 3, 5]

ns=list(set(ns))

In [408]:
# 4. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자',
#'청년', '중년', '장년', '노년' 승객의 비율을 구한다. 각 그룹 별로 비율의 전체
#합은 1이 되어야 한다.

# Age 1 미만인 경우가 있어 bins[0] 1에서 0으로 수정
bins = [0, 15, 25, 35, 60, 99] 
labels = ["미성년자", "청년", "중년", "장년", "노년"]

live=ttn[ttn.Survived==1] # 생존자 그룹
dead=ttn[ttn.Survived==0] # 사망자 그룹

live_age=pd.cut(live.Age,bins,labels=labels).value_counts()
dead_age=pd.cut(dead.Age,bins,labels=labels).value_counts()

age_ratio_live=live_age/sum(live_age) # 전체 대비 각 연령대 비율
age_ratio_dead=dead_age/sum(dead_age) 

print(age_ratio_live,'\n')
print(age_ratio_dead)

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: Age, dtype: float64